Revit 2027 API
Concrete.ConcreteBumpMap Property
 The property labeled "Image" from the "Concrete" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string ConcreteBumpMap { get; }
Public Shared ReadOnly Property ConcreteBumpMap As String
	Get
public:
static property String^ ConcreteBumpMap {
	String^ get ();
}
static member ConcreteBumpMap : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.
See Also
Reference
Concrete Class
Autodesk.Revit.DB.Visual Namespace